Repository: yamarten/atproto-website
Catalog: translation/omegat/project_save.tmx
Source language: en_us
Languages: ja

source: [ActivityPub](https://en.wikipedia.org/wiki/ActivityPub) is a federated social networking technology popularized by [Mastodon](https://joinmastodon.org/).
ja: [ActivityPub](https://en.wikipedia.org/wiki/ActivityPub)は、[Mastodon](https://joinmastodon.org/)によって普及したフェデレーションソーシャルネットワーキングテクノロジーです。

source: [Auth](/guides/auth)
ja: [認証](/guides/auth)

source: [Backend For Frontend (BFF)](https://datatracker.ietf.org/doc/html/draft-ietf-oauth-browser-based-apps#name-backend-for-frontend-bff): The OAuth session is established between the app backend server and the PDS. This server-side session is associated with the user's frontend session via mechanisms such as session cookies. The frontend makes requests to the PDS by proxying them through the backend, which handles the OAuth authorization.
ja: [Backend For Frontend（BFF）](https://datatracker.ietf.org/doc/html/draft-ietf-oauth-browser-based-apps#name-backend-for-frontend-bff)：OAuthセッションはアプリケーションのバックエンドサーバーとPDSの間で確立されます。このサーバーサイドセッションは、セッションクッキーなどのメカニズムを介してユーザーのフロントエンドセッションと関連付けられます。フロントエンドはバックエンドを通じてリクエストをプロキシすることでPDSに対してリクエストを行い、バックエンドがOAuth認可を処理します。

source: [Backfilling](/guides/backfilling)
ja: [バックフィル](/guides/backfilling)

source: [Blob Specs](/specs/blob)
ja: [blob仕様](/specs/blob)

source: [Blob lifecycle](/guides/blob-lifecycle)
ja: [blobライフサイクル](/guides/blob-lifecycle)

source: [Blob security](/guides/blob-security)
ja: [blobのセキュリティ](/guides/blob-security)

source: [Browse](https://blueskydirectory.com/feeds/all) custom feeds.
ja: [カスタムフィードを探す](https://blueskydirectory.com/feeds/all)

source: [Client Assertion Backend](https://github.com/bluesky-social/proposals/tree/main/0010-client-assertion-backend): A proposed alternative to the TMB pattern with simplified server-side logic.
ja: [Client Assertion Backend](https://github.com/bluesky-social/proposals/tree/main/0010-client-assertion-backend)：サーバーサイドロジックを簡略化したTMBパターンの代替案です。

source: [Creating a labeler](/guides/creating-a-labeler)
ja: [ラベラーの作成](/guides/creating-a-labeler)

source: [DID PLC](https://web.plc.directory/) is a self-authenticating DID which is strongly-consistent, recoverable, and allows for key rotation. Each identity is made up of a series of signed operations that each reference the preceding operation in a chain back to the genesis operation. Any observer can verify the chain of operations in order to verify the current state of the identity.
ja: [DID PLC](https://web.plc.directory/)は自己認証型のDIDで、強い一貫性があり、復旧可能で、鍵のローテーションを可能にします。各IDは、前のオペレーションを連鎖的に参照する署名付きオペレーションの系列で構成され、ID作成オペレーションまで遡ります。任意の観測者はオペレーションの連鎖を検証することで、IDの現在の状態を検証できます。

source: [Event Stream spec](/specs/event-stream)
ja: [イベントストリーム仕様](/specs/event-stream)

source: [Feeds](/guides/feeds)
ja: [フィード](/guides/feeds)

source: [Images and Video](/guides/images-and-video)
ja: [画像と動画](/guides/images-and-video)

source: [Indigo](https://github.com/bluesky-social/indigo/tree/main/atproto/auth/oauth) ([Online API Docs](https://pkg.go.dev/github.com/bluesky-social/indigo/atproto/auth/oauth)) - Suitable for native apps or server-side deployments
ja: [Indigo](https://github.com/bluesky-social/indigo/tree/main/atproto/auth/oauth)（[APIドキュメント](https://pkg.go.dev/github.com/bluesky-social/indigo/atproto/auth/oauth)）- ネイティブアプリまたはサーバーサイドデプロイメントに適しています

source: [Installing Lexicons](/guides/installing-lexicons)
ja: [Lexiconのインストール](/guides/installing-lexicons)

source: [Label Specs](/specs/label)
ja: [ラベル仕様](/specs/label)

source: [Labels spec](/specs/label)
ja: [ラベル仕様](/specs/label)

source: [Labels](/guides/labels)
ja: [ラベル](/guides/labels)

source: [Lexicon Specs](/specs/lexicon)
ja: [Lexicon仕様](/specs/lexicon)

source: [Lexicon Style Guide](/guides/lexicon-style-guide)
ja: [Lexiconスタイルガイド](/guides/lexicon-style-guide)

source: [Lexicons](/guides/lexicon)
ja: [Lexicon](/guides/lexicon)

source: [Lexicons](/guides/lexicon) define Atproto records. A baseline feed generator requires the `app.bsky.feed.describeFeedGenerator` and `app.bsky.feed.getFeedSkeleton` Lexicons. You can use `lex` to download and build these Lexicons into your project:
ja: [Lexicon](/guides/lexicon)はatprotoのレコードを定義します。基本的なフィードジェネレーターには`app.bsky.feed.describeFeedGenerator`と`app.bsky.feed.getFeedSkeleton`のLexiconが必要です。`lex`を使えば、これらのLexiconをダウンロードしてプロジェクトに組み込めます。

source: [Lexicons](/guides/lexicon) define Atproto records. Your bot will create Bluesky posts, using the [app.bsky.feed.post](https://pdsls.dev/at://did:plc:ewvi7nxzyoun6zhxrhs64oiz/app.bsky.feed.post/3juc4thkx452i#schema) Lexicon. You can use `lex` to download and build this Lexicon into your project:
ja: [Lexicon](/guides/lexicon)はatprotoのレコードを定義します。ボットは[app.bsky.feed.post](https://pdsls.dev/at://did:plc:ewvi7nxzyoun6zhxrhs64oiz/app.bsky.feed.post/3juc4thkx452i#schema) Lexiconを使ってBluesky投稿を作成します。`lex`を使えば、このLexiconをダウンロードしてプロジェクトに組み込めます。

source: [Lexicons](/guides/lexicon) define the schema for records in Atproto. To create this tutorial, we've already published a new "Statusphere" Lexicon to our repository, available at `xyz.statusphere.status`. You can use `lex` to download and build this Lexicon into your project:
ja: [Lexicon](/guides/lexicon)はatprotoのレコードスキーマを定義します。このチュートリアル向けに、新しい"Statusphere" Lexicon（`xyz.statusphere.status`）をすでに公開しています。`lex`を使ってこのLexiconを取得し、プロジェクトに取り込みます。

source: [Microcosm](https://constellation.microcosm.blue) provides a set of resources for working with backlinks.
ja: [Microcosm](https://constellation.microcosm.blue)はバックリンクを操作するための一連のリソースを提供します。

source: [Migrating PDS Account with `goat`](https://whtwnd.com/bnewbold.net/3l5ii332pf32u)
ja: [`goat`を使ったPDSアカウント移行](https://whtwnd.com/bnewbold.net/3l5ii332pf32u)

source: [Moderation](/guides/moderation)
ja: [モデレーション](/guides/moderation)

source: [OAuth patterns](/guides/oauth-patterns)
ja: [OAuthパターン](/guides/oauth-patterns)

source: [OAuth spec](/specs/oauth)
ja: [OAuth仕様](/specs/oauth)

source: [Osprey](https://github.com/bluesky-social/osprey-atproto) is an event stream decisions engine and analysis UI designed to investigate and take automatic action, to enable sustainable at-scale moderation. It makes use of [Kafka](https://kafka.apache.org/) with its own [rules engine](https://github.com/roostorg/osprey/blob/main/docs/rules.md).
ja: [Osprey](https://github.com/bluesky-social/osprey-atproto)は、持続可能な大規模モデレーションを可能にするために調査と自動対応を行う、イベントストリーム判定エンジンおよび分析用UIです。内部で[Kafka](https://kafka.apache.org/)と独自の[ルールエンジン](https://github.com/roostorg/osprey/blob/main/docs/rules.md)を利用します。

source: [Ozone](https://github.com/bluesky-social/ozone) is our labeling service and moderation interface. If you are building your own AppView, AppViews can use the Ozone `subscribeLabel` "firehose" to receive updates. Ozone can also be granted permission to read additional PDS-level private information, such as the account email. This is helpful for things like account recovery.
ja: [Ozone](https://github.com/bluesky-social/ozone)はラベリングサービスおよびモデレーションインターフェースです。独自のAppViewを構築している場合、AppViewはOzoneの`subscribeLabel` firehoseを使用して更新を受け取ることができます。Ozoneにはアカウントメールのような追加のPDSレベルのプライベート情報を読み取る権限を与えることもできます。これはアカウント復旧などに役立ちます。

source: [Ozone](https://github.com/bluesky-social/ozone) is our reference labeling service for Atmosphere apps, and includes a web interface for triaging and actioning moderation reports.
ja: [Ozone](https://github.com/bluesky-social/ozone)はAtmosphereアプリ用のリファレンスラベリングサービスであり、報告をトリアージして対応するためのウェブインターフェースが含まれています。

source: [PDS MOOver](https://pdsmoover.com/) — a third-party tool for migrating PDS accounts
ja: [PDS MOOver](https://pdsmoover.com/) — PDSアカウント移行のためのサードパーティツール

source: [Permissions spec](/specs/permission)
ja: [権限仕様](/specs/permission)

source: [Publishing Lexicons](/guides/publishing-lexicons)
ja: [Lexiconの発行](/guides/publishing-lexicons)

source: [RDF](https://en.wikipedia.org/wiki/Resource_Description_Framework) is intended for extremely general cases in which the systems share very little infrastructure. It's conceptually elegant but difficult to use, often adding a lot of syntax which devs don't understand. JSON-LD simplifies the task of consuming RDF vocabularies, but it does so by hiding the underlying concepts, not by making RDF more legible.
ja: [RDF](https://en.wikipedia.org/wiki/Resource_Description_Framework)は、システムがほとんどインフラストラクチャを共有しない、極めて一般的なケースを対象としています。概念的にはエレガントですが、使いにくく、開発者が理解できない構文が多数追加されることがよくあります。JSON-LDはRDFボキャブラリの使用タスクを簡素化しますがRDFを読みやすくするのではなく、基礎となる概念を隠すことによって簡素化します。

source: [Read more](https://docs.bsky.app/blog/blueskys-moderation-architecture) about moderation on our blog.
ja: 当社のブログでモデレーションに関する[詳細な解説](https://docs.bsky.app/blog/blueskys-moderation-architecture)をご覧ください。

source: [Reading data](/guides/reading-data)
ja: [データ読み出し](/guides/reading-data)

source: [Reads and Writes](/guides/reads-and-writes)
ja: [読み取りと書き込み](/guides/reads-and-writes)

source: [Record Key spec](/specs/record-key)
ja: [レコードキー仕様](/specs/record-key)

source: [Record key spec](/specs/record-key)
ja: [レコードキー仕様](/specs/record-key)

source: [Record keys spec](/specs/record-key)
ja: [レコードキー仕様](/specs/record-key)

source: [Repository spec](/specs/repository)
ja: [リポジトリ仕様](/specs/repository)

source: [SDK authentication](/guides/sdk-auth)
ja: [SDKによる認証](/guides/sdk-auth)

source: [Scopes](/guides/scopes)
ja: [スコープ](/guides/scopes)

source: [Social graph](/guides/social-graph)
ja: [ソーシャルグラフ](/guides/social-graph)

source: [Streaming data](/guides/streaming-data)
ja: [データストリーミング](/guides/streaming-data)

source: [Subscriptions](/guides/subscriptions)
ja: [サブスクリプション](/guides/subscriptions)

source: [Sync spec](/specs/sync)
ja: [同期仕様](/specs/sync)

source: [Sync](/guides/sync)
ja: [同期](/guides/sync)

source: [Tap](/guides/backfilling#using-tap) is the best way to synchronize and stream AT Protocol records. You'll use the Tap [TypeScript library](https://www.npmjs.com/package/@atproto/tap) to sync new records in your database. Create `lib/tap/index.ts`:
ja: [Tap](/guides/backfilling#using-tap)はATプロトコルレコードを同期・ストリームする最適な方法です。Tapの[TypeScriptライブラリ](https://www.npmjs.com/package/@atproto/tap)を使って、データベースへ新規レコードを同期します。`lib/tap/index.ts`を作成してください:

source: [Token-Mediating Backend (TMB)](https://datatracker.ietf.org/doc/html/draft-ietf-oauth-browser-based-apps#name-token-mediating-backend): Similar to the BFF pattern, except the backend passes OAuth access tokens to the frontend once the session has been established, allowing the frontend to make direct requests to the PDS.
ja: [Token-Mediating Backend（TMB）](https://datatracker.ietf.org/doc/html/draft-ietf-oauth-browser-based-apps#name-token-mediating-backend)：BFFパターンに似ていますが、セッションが確立されると、バックエンドがOAuthアクセストークンをフロントエンドに渡し、フロントエンドがPDSに直接リクエストを行うことができます。

source: [URI scheme](/specs/at-uri-scheme)
ja: [URIスキーム](/specs/at-uri-scheme)

source: [Using Ozone](/guides/using-ozone)
ja: [Ozoneの使用](/guides/using-ozone)

source: [Video handling](/guides/video-handling)
ja: [動画の取り扱い](/guides/video-handling)

source: [Writing data](/guides/writing-data)
ja: [データ書き込み](/guides/writing-data)

source: [XRPC](/specs/xrpc) is HTTP with some added conventions.
ja: [XRPC](/specs/xrpc)は、いくつかの規則が追加されたHTTPです。

source: [XRPC](/specs/xrpc) is HTTP with some added conventions. We're aiming to retire the term "XRPC" and just refer to it as the ATProto usage of HTTP.
ja: [XRPC](/specs/xrpc)は、いくつかの規則が追加されたHTTPです。私たちは「XRPC」という用語を廃止し、単にHTTPのATプロトコル用法と呼ぶことを目指しています。

source: [graze.social](https://www.graze.social/) provides an application model for AT Proto feeds.
ja: [graze.social](https://www.graze.social/)はATプロトコルフィードのアプリケーションモデルを提供します。

source: `!hide` which puts a generic warning on content that cannot be clicked through, and filters the content from listings. Not configurable by the user.
ja: `!hide`はクリックできない汎用警告をコンテンツに置き、一覧からコンテンツをフィルタリングします。ユーザー設定の影響を受けません。

source: `!no-unauthenticated` which makes the content inaccessible to logged-out users in applications which respect the label.
ja: `!no-unauthenticated`はラベルを尊重するアプリケーションにおいて、ログインしていない利用者からコンテンツをアクセス不可にします。

source: `!warn` which puts a generic warning on content but can be clicked through. Not configurable by the user.
ja: `!warn`は汎用警告をコンテンツに置きますが、クリックすれば閲覧可能です。ユーザー設定の影響を受けません。

source: `PDS_PLC_ROTATION_KEY_K256_PRIVATE_KEY_HEX`: used by the PDS service to perform operations on the PLC including recovering user accounts. If you are using AWS, this is configurable with the [AWS Key Management Service](https://aws.amazon.com/kms/), using `PDS_PLC_ROTATION_KEY_KMS_KEY_ID`.
ja: `PDS_PLC_ROTATION_KEY_K256_PRIVATE_KEY_HEX`：PDSサービスがユーザーアカウントの復旧を含むPLC上の操作を実行するために使用されます。AWSを使用している場合、これは[AWS KMS](https://aws.amazon.com/kms/) で`PDS_PLC_ROTATION_KEY_KMS_KEY_ID`を使用して構成可能です。

source: `PDS_RECOVERY_DID_KEY`: a public key that is added to the users DID. The corresponding private key **must be** stored in a safe place and can be used to recover user accounts in case of a catastrophic loss of data including the `PDS_PLC_ROTATION_KEY_K256_PRIVATE_KEY_HEX`.
ja: `PDS_RECOVERY_DID_KEY`：ユーザーDIDに追加される公開鍵。対応する秘密鍵は安全な場所に保存**されなければならず**、`PDS_PLC_ROTATION_KEY_K256_PRIVATE_KEY_HEX`を含むデータの壊滅的な損失の場合にユーザーアカウントを復旧するために使用できます。

source: `PDS_REDIS_SCRATCH_ADDRESS` — your Redis instance (e.g. localhost:6379)
ja: `PDS_REDIS_SCRATCH_ADDRESS` — Redisインスタンス（例：localhost:6379）

source: `PDS_REDIS_SCRATCH_PASSWORD` — your Redis credentials.
ja: `PDS_REDIS_SCRATCH_PASSWORD` — Redis認証情報

source: `PUBLIC_URL` falls back to `127.0.0.1:3000` to ensure you always redirect to the correct host. This avoids cookie issues that arise from `localhost` vs `127.0.0.1` mismatches.
ja: `PUBLIC_URL`は`127.0.0.1:3000`にフォールバックして、常に正しいホストへリダイレクトするようにしています。これにより`localhost`と`127.0.0.1`の不一致で発生するクッキー問題を回避できます。

source: `RepoPutRecord` is idempotent — it'll create the record if it doesn't exist, or overwrite it if it does. </TabPanel> </TabPanels> </TabGroup>
ja: `RepoPutRecord`は冪等です。レコードが存在しない場合は作成し、存在する場合は上書きします。 </TabPanel> </TabPanels> </TabGroup>

source: ``` Root | at://alice.com Collection | at://alice.com/app.bsky.feed.post Record | at://alice.com/app.bsky.feed.post/1234 ```
ja: ``` ルート | at://alice.com コレクション | at://alice.com/app.bsky.feed.post レコード | at://alice.com/app.bsky.feed.post/1234 ```

source: ```bash npm install @atproto/lex @atproto/lex-password-agent ``` </TabPanel> <TabPanel value="go"> The first step when working with AT data is authenticating. You can authenticate using any [OAuth](/guides/auth) provider, or with password authentication from our SDK.
ja: ```bash npm install @atproto/lex @atproto/lex-password-agent ``` </TabPanel> <TabPanel value="go"> ATデータを扱う最初のステップは認証です。任意の[OAuth](/guides/auth)プロバイダを使用して認証することもできますし、SDKのパスワード認証を使用することもできます。

source: ```bash # Replace with your own DID below curl -H 'Content-Type: application/json' -d '{"dids":["DID"]}' http://localhost:2480/repos/add ```
ja: ```bash # あなたのDIDに置き換えてください curl -H 'Content-Type: application/json' -d '{"dids":["DID"]}' http://localhost:2480/repos/add ```

source: ```bash BOT_PDS= # eg 'https://bsky.social' if you aren't self-hosting your PDS BOT_HANDLE= # eg 'alice.bsky.social' BOT_PASSWORD= ```
ja: ```bash BOT_PDS= # eg 'https://bsky.social' （セルフホストPDSの場合はそのURLを使用） BOT_HANDLE= # eg 'alice.bsky.social' BOT_PASSWORD= ```

source: ```bash git clone https://github.com/bluesky-social/statusphere-example-app.git cd statusphere-example-app cp .env.template .env npm install npm run dev # Navigate to http://localhost:8080 ```
ja: ```bash git clone https://github.com/bluesky-social/statusphere-example-app.git cd statusphere-example-app cp .env.template .env npm install npm run dev # http://localhost:8080に移動します ```

source: ```go // Store auth info on the client for subsequent requests client.Auth = &xrpc.AuthInfo{ AccessJwt: session.AccessJwt, RefreshJwt: session.RefreshJwt, Handle: session.Handle, Did: session.Did, }
ja: ```go // 後続のリクエストのために認証情報をクライアントに保存します client.Auth = &xrpc.AuthInfo{ AccessJwt: session.AccessJwt, RefreshJwt: session.RefreshJwt, Handle: session.Handle, Did: session.Did, }

source: ```json { "scripts": { // Add this line: "gen-key": "tsx scripts/gen-key.ts", } } ```
ja: ```json { "scripts": { // この行を追加 "gen-key": "tsx scripts/gen-key.ts", } } ```

source: ```markdown { /** DID of the actor who created this label. */ src: string /** AT URI of the record, repository (account), or other resource that this label applies to. */ uri: string /** Optionally, CID specifying the specific version of 'uri' resource this label applies to. */ cid?: string /** The short string name of the value or type of this label. */ val: string /** If true, this is a negation label, overwriting a previous label. */ neg?: boolean /** Timestamp when this label was created. */ cts: string }
ja: ```markdown { /** このラベルを作成したアクターのDID */ src: string /** このラベルが適用されるレコード、リポジトリ（アカウント）、またはその他のリソースのAT URI */ uri: string /** オプション：このラベルが適用される'uri'リソースのバージョンを指定するCID */ cid?: string /** このラベルの値または種類を表す短い文字列名 */ val: string /** trueの場合、これは以前のラベルを取り消す否定ラベル */ neg?: boolean /** このラベルが作成されたときのタイムスタンプ */ cts: string }

source: ```shell # Run tap go run ./cmd/tap run --disable-acks=true # By default, the service uses SQLite at `./tap.db` and binds to port `:2480`.
ja: ```shell # tapを実行する go run ./cmd/tap run --disable-acks=true # デフォルトでは、サービスは`./tap.db`のSQLiteと`:2480`ポートを使用します。

source: ```ts // Posting logic async function makePost(session: PasswordSession) { const client = new Client(session) await client.create(app.bsky.feed.post, { text: '🙂', createdAt: new Date().toISOString(), }) console.log('Just posted!') }
ja: ```ts // 投稿ロジック async function makePost(session: PasswordSession) { const client = new Client(session) await client.create(app.bsky.feed.post, { text: '🙂', createdAt: new Date().toISOString(), }) console.log('Just posted!') }

source: ```ts async function main() { const session = await login() await makePost(session) // Run this on a cron job const scheduleExpression = '0 */3 * * *' const job = new CronJob(scheduleExpression, () => makePost(session)) job.start() } ```
ja: ```ts async function main() { const session = await login() await makePost(session) // cronジョブで実行 const scheduleExpression = '0 */3 * * *' const job = new CronJob(scheduleExpression, () => makePost(session)) job.start() } ```

source: ```tsx const post = await client.get(app.bsky.feed.post, { rkey: '3jxf7z2k3q2', }) ``` </TabPanel> <TabPanel value="go"> You can use `RepoGetRecord()` to read an individual record by its [`rkey`](/specs/record-key):
ja: ```tsx const post = await client.get(app.bsky.feed.post, { rkey: '3jxf7z2k3q2', }) ``` </TabPanel> <TabPanel value="go"> `RepoGetRecord()`を使用して、[`rkey`](/specs/record-key)で個別レコードを読み取ることができます。

source: ```tsx console.log(result.uri) // at://did:plc:... console.log(result.cid) ``` </TabPanel> <TabPanel value="go"> To create a new record, call `RepoCreateRecord()` with your target Lexicon and any required fields:
ja: ```tsx console.log(result.uri) // at://did:plc:... console.log(result.cid) ``` </TabPanel> <TabPanel value="go"> 新しいレコードの作成には、`RepoCreateRecord()`に必要なフィールドを添えて、対象のLexiconに対して呼び出します。

source: ```typescript /** src/db.ts **/ // Create our statuses table await db.schema .createTable('status') .addColumn('uri', 'varchar', (col) => col.primaryKey()) .addColumn('authorDid', 'varchar', (col) => col.notNull()) .addColumn('status', 'varchar', (col) => col.notNull()) .addColumn('createdAt', 'varchar', (col) => col.notNull()) .addColumn('indexedAt', 'varchar', (col) => col.notNull()) .execute() ```
ja: ```typescript /** src/db.ts **/ // ステータステーブルを作成します await db.schema .createTable('status') .addColumn('uri', 'varchar', (col) => col.primaryKey()) .addColumn('authorDid', 'varchar', (col) => col.notNull()) .addColumn('status', 'varchar', (col) => col.notNull()) .addColumn('createdAt', 'varchar', (col) => col.notNull()) .addColumn('indexedAt', 'varchar', (col) => col.notNull()) .execute() ```

source: ```typescript /** src/ingester.ts **/ // If the write is a valid status update if ( evt.collection === 'xyz.statusphere.status' && Status.isRecord(record) && Status.validateRecord(record).success ) { // Store the status in our SQLite await db .insertInto('status') .values({ uri: evt.uri.toString(), authorDid: evt.author, status: record.status, createdAt: record.createdAt, indexedAt: new Date().toISOString(), }) .onConflict((oc) => oc.column('uri').doUpdateSet({ status: record.status, indexedAt: new Date().toISOString(), }) ) .execute() } ```
ja: ```typescript /** src/ingester.ts **/ // 書き込みが有効なステータス更新である場合 if ( evt.collection === 'xyz.statusphere.status' && Status.isRecord(record) && Status.validateRecord(record).success ) { // ステータスをSQLiteに保存します await db .insertInto('status') .values({ uri: evt.uri.toString(), authorDid: evt.author, status: record.status, createdAt: record.createdAt, indexedAt: new Date().toISOString(), }) .onConflict((oc) => oc.column('uri').doUpdateSet({ status: record.status, indexedAt: new Date().toISOString(), }) ) .execute() } ```

source: ```typescript /** src/routes.ts **/ // "Set status" handler router.post( '/status', handler(async (req, res) => { // ...
ja: ```typescript /** src/routes.ts **/ // "Set status" ハンドラー router.post( '/status', handler(async (req, res) => { // ...

source: ```typescript /** src/routes.ts **/ // "Set status" handler router.post( '/status', handler(async (req, res) => { // If the user is signed in, get an agent which communicates with their server const agent = await getSessionAgent(req, res, ctx) if (!agent) { return res.status(401).type('html').send('Error: Session required') }
ja: ```typescript /** src/routes.ts **/ // "Set status" ハンドラー router.post( '/status', handler(async (req, res) => { // ユーザーがサインインしている場合は、サーバーと通信するエージェントを取得します const agent = await getSessionAgent(req, res, ctx) if (!agent) { return res.status(401).type('html').send('Error: Session required') }

source: ```typescript /** src/routes.ts **/ // Homepage router.get( '/', handler(async (req, res) => { // ...
ja: ```typescript /** src/routes.ts **/ // ホームページ router.get( '/', handler(async (req, res) => { // ...

source: ```typescript /** src/routes.ts **/ // Homepage router.get( '/', handler(async (req, res) => { // If the user is signed in, get an agent which communicates with their server const agent = await getSessionAgent(req, res, ctx)
ja: ```typescript /** src/routes.ts **/ // ホームページ router.get( '/', handler(async (req, res) => { // ユーザーがサインインしている場合は、サーバーと通信するエージェントを取得します const agent = await getSessionAgent(req, res, ctx)

source: ```typescript /** src/routes.ts **/ // Login handler router.post( '/login', handler(async (req, res) => { // Initiate the OAuth flow const handle = req.body?.handle const url = await oauthClient.authorize(handle, { scope: 'atproto transition:generic', }) return res.redirect(url.toString()) }) ) ```
ja: ```typescript /** src/routes.ts **/ // ログインハンドラー router.post( '/login', handler(async (req, res) => { // OAuthフローを開始 const handle = req.body?.handle const url = await oauthClient.authorize(handle, { scope: 'atproto transition:generic', }) return res.redirect(url.toString()) }) ) ```

source: ```typescript /** src/routes.ts **/ // OAuth callback to complete session creation router.get( '/oauth/callback', handler(async (req, res) => { // Store the credentials const { session } = await oauthClient.callback(params)
ja: ```typescript /** src/routes.ts **/ // セッション作成を完了するためのOAuthコールバック router.get( '/oauth/callback', handler(async (req, res) => { // 資格情報を保存します const { session } = await oauthClient.callback(params)

source: ```typescript /** src/routes.ts **/ import * as Status from '#/lexicon/types/xyz/statusphere/status' // ... // "Set status" handler router.post( '/status', handler(async (req, res) => { // ...
ja: ```typescript /** src/routes.ts **/ import * as Status from '#/lexicon/types/xyz/statusphere/status' // ... // "Set status" ハンドラー router.post( '/status', handler(async (req, res) => { // ...
